DataProcessors/ДашбортКапитал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДашбортКапитал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийКапитал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДенег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАктивов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаВалют</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаАктивов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенег</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиВалюты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАктивов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ДашбортКапитал/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОценки) Тогда
		Объект.ДатаОценки = ТекущаяДата();
	КонецЕсли;
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	// 1. Подготовка параметров
	ПериодОценки = ?(ЗначениеЗаполнено(Объект.ДатаОценки), КонецДня(Объект.ДатаОценки), ТекущаяДата());
	
	// Очищаем таблицы перед заполнением
	Объект.ТаблицаВалют.Очистить();
	Объект.ТаблицаАктивов.Очистить();
	
	// 2. Единый запрос для дашборда
	ТекстЗапроса = 
	"ВЫБРАТЬ

	|	""Деньги"" КАК Тип,
	|	ОстаткиДенег.Пользователь КАК Пользователь,
	|	""Рубли"" КАК Наименование,

	|	ОстаткиДенег.СуммаОстаток КАК СуммаРуб,
	|	0 КАК СуммаВал,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,

	|	0 КАК Количество,
	|	0 КАК Цена
	|ИЗ

	|	РегистрНакопления.ОстаткиДенег.Остатки(&Период, ) КАК ОстаткиДенег
	|
	|ОБЪЕДИНИТЬ ВСЕ

	|
	|ВЫБРАТЬ
	|	""Валюта"",

	|	ОстаткиВалюты.Пользователь,
	|	ОстаткиВалюты.Валюта.Наименование,
	|	ОстаткиВалюты.СуммаОстаток * ЕСТЬNULL(КурсыВал.Курс, 1),

	|	ОстаткиВалюты.СуммаОстаток,
	|	ОстаткиВалюты.Валюта,
	|	0,

	|	ЕСТЬNULL(КурсыВал.Курс, 1)
	|ИЗ
	|	РегистрНакопления.ОстаткиВалюты.Остатки(&Период, ) КАК ОстаткиВалюты

	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВал
	|		ПО ОстаткиВалюты.Валюта = КурсыВал.Валюта
	|

	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ

	|	""Активы"",
	|	ОстаткиАктивов.Пользователь,
	|	ОстаткиАктивов.Актив.Наименование КАК Наименование,

	|	ОстаткиАктивов.ТекущаяСтоимостьОстаток * ЕСТЬNULL(КурсыАкт.Курс, 1),
	|	ОстаткиАктивов.ТекущаяСтоимостьОстаток,
	|	ОстаткиАктивов.Актив.Валюта,

	|	ОстаткиАктивов.КоличествоОстаток,
	|	ВЫБОР КОГДА ОстаткиАктивов.КоличествоОстаток <> 0 ТОГДА ОстаткиАктивов.ТекущаяСтоимостьОстаток / ОстаткиАктивов.КоличествоОстаток ИНАЧЕ 0 КОНЕЦ
	|ИЗ

	|	РегистрНакопления.ОстаткиАктивов.Остатки(&Период, ) КАК ОстаткиАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыАкт
	|		ПО ОстаткиАктивов.Актив.Валюта = КурсыАкт.Валюта

	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь,

	|	Тип
	|ИТОГИ
	|	СУММА(СуммаРуб)

	|ПО
	|	ОБЩИЕ,
	|	Тип";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", ПериодОценки);
	Результат = Запрос.Выполнить();
	
	// 3. Заполнение верхних числовых показателей (Обход по группировкам)
	ВыборкаОбщие = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщие.Следующий() Тогда
		Объект.ОбщийКапитал = ВыборкаОбщие.СуммаРуб;
		
		ВыборкаПоТипам = ВыборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Тип");
		Пока ВыборкаПоТипам.Следующий() Цикл
			Если ВыборкаПоТипам.Тип = "Деньги" Тогда
				Объект.СуммаДенег = ВыборкаПоТипам.СуммаРуб;
			ИначеЕсли ВыборкаПоТипам.Тип = "Валюта" Тогда
				Объект.СуммаВалюты = ВыборкаПоТипам.СуммаРуб;
			ИначеЕсли ВыборкаПоТипам.Тип = "Активы" Тогда
				Объект.СуммаАктивов = ВыборкаПоТипам.СуммаРуб;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// 4. Заполнение таблиц (Линейная выборка БЕЗ итоговых строк)
	ВыборкаДетали = Результат.Выбрать(); 
	Пока ВыборкаДетали.Следующий() Цикл
		
		// СТРОГАЯ ПРОВЕРКА: Пропускаем итоговые строки запроса.
		// В итоговой строке измерения (Тип и Пользователь) будут Неопределено или пустые.
		Если НЕ ЗначениеЗаполнено(ВыборкаДетали.Тип) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетали.Пользователь) Тогда
			Продолжить;
		КонецЕсли;

		Если ВыборкаДетали.Тип = "Валюта" Тогда
			НоваяСтрока = Объект.ТаблицаВалют.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетали.Пользователь;
			НоваяСтрока.Валюта      = ВыборкаДетали.Валюта;
			НоваяСтрока.Сумма       = ВыборкаДетали.СуммаВал;
			НоваяСтрока.СуммаВРублях = ВыборкаДетали.СуммаРуб;
			
		ИначеЕсли ВыборкаДетали.Тип = "Активы" Тогда
			НоваяСтрока = Объект.ТаблицаАктивов.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетали.Пользователь;
			НоваяСтрока.Актив       = ВыборкаДетали.Наименование;
			НоваяСтрока.Количество  = ВыборкаДетали.Количество;
			НоваяСтрока.Цена        = ВыборкаДетали.Цена;
			НоваяСтрока.Сумма       = ВыборкаДетали.СуммаВал;
			НоваяСтрока.СуммаВРублях = ВыборкаДетали.СуммаРуб;
		КонецЕсли;
	КонецЦикла;
	
	// 5. Финальная сортировка (чтобы пользователи шли по алфавиту)
	Объект.ТаблицаВалют.Сортировать("Пользователь Возр");
	Объект.ТаблицаАктивов.Сортировать("Пользователь Возр");
	
КонецПроцедуры
